Repository: Babs-elec/linuxcnc-features
Catalog: locale/*/LC_MESSAGES/linuxcnc-features.po
Languages: fr

source: Warning! Failed to load catalog icon from: %(icon)s at path %(path)s!
fr: Avertissement! Échec du chargement du fichier d'icônes du catalogue : %(icon)s; chemin %(path)s!

source: name
fr: nom

source: Feature ini file %(src)s not found in %(path)s!
fr: Le fichier ini %(src)s absent de %(path)s!

source: Error! Can not find file %(file)s in %(path)s, wile processing <import> tag in feature!
fr: Erreur! Fichier %(file)s absent de %(path)s, lors du traitement <import> étiquette dans "feature"!

source: Warning! Problem while loading ini file!
fr: Avertissement! Problème du chargement du fichier ini!

source: Error! Fatal! Cannot find features catalog %(src)s at %(path)s!
fr: Erreur fatale! Impossible de trouver le catalogue %(src)s dans %(path)s!

source: Add feature
fr: Ajouter attribut

source: Catalog root
fr: Racine du catalogue

source: Upper level
fr: Niveau supérieur

source: Warning defaults.ngc was not found in path %s!
fr: Avertissement! defaults.ngc absent dans %s!

source: Warning there's no 'sub' key in %s
fr: Avertissement! Aucune clé 'sub' dans %s

source: Warning: Error while parsing %s...
fr: Avertissement! Erreur lors de l'analyse de %s...

source: Error in dst, or src wile moving subtrees! (dst %(dst)s) (src %(src)s)
fr: Erreur dans destination ou source au déplacement d'arborescence! (destination %(dst)s) (source %(src)s)

source: Group
fr: Groupe

source: <big>Can group subroutines</big> Drag and drop subroutines into Items parameter.
fr: <big><b>Regrouper les sous-routines</b></big> Glisser-déposer les sous-routines dans le paramètre items.

source: Drop Subroutines here
fr: Déposer les sous-routines ici

source: Linear array
fr: Tableau linéaire

source: <big>Create array of items</big> Drag and drop subroutines into Items parameter. Parameters num, dX, dY, dZ Uses G57 to make offsets! Returns to G54 afterwards!
fr: <big><b>Créer un tableau d'items</b></big> Glisser-déposer les sous-routines dans le paramètre items. Paramètres: <i>Copies, dX, dY, dZ</i> Utilise G57 pour les compensations! <b>Retour à G54 à la fin!</b>

source: <big>Create array of items</big> Drag and drop subroutines into Items parameter. Parameters num, dX, dY, dZ Modifies defined coordinate system to make offsets! Returns to G54 afterwards!
fr: <big><b>Créer un tableau d'items</b></big> Glisser-déposer les sous-routines dans le paramètre items. Paramètres: <i>Copies, cX, cY, Diamètre</i> Modifie les coordonnées système pour les compensations! <b>Retour à G54 à la fin!</b>

source: Number
fr: Copies

source: Number of copies
fr: Nombre de copies

source: Origin X
fr: Origine X

source: Origin Y
fr: Origine Y

source: Origin Z
fr: Origine Z

source: Origin angle
fr: Angle de l'origine

source: X step
fr: Pas X

source: Y step
fr: Pas Y

source: Z step
fr: Pas Z

source: Angle step
fr: Pas angulaire

source: Coordinate system G
fr: Système coordonnées G

source: Use this coordinate system
fr: Utiliser ce système de coordonnées

source: Probe
fr: Sonde

source: <big>Probe downwards</big>
fr: <big><b>Sonde dir. bas</b></big>

source: G38.2 - probe toward workpiece, stop on contact, signal error if failure G38.3 - probe toward workpiece, stop on contact G38.4 - probe away from workpiece, stop on loss of contact, signal error if failure G38.5 - probe away from workpiece, stop on loss of contact (Do not write G, just '38.2'.)
fr: G38.2 - sonde vers la pièce, arrêt sur contact ou erreur en cas d'échec G38.3 - sonde vers la pièce, arrêt sur contact G38.4 - sonde s'éloigne de la pièce, arrêt sur perte de contact ou erreur en cas d'échec G38.5 - sonde s'éloigne de la pièce, arrêt sur perte de contact - Écrire seulement le code sans G (exemple '38.2'.)

source: Feed
fr: Alimentation

source: Probe fast feed
fr: Sonde vitesse rapide

source: Latch dist
fr: Dist. enclanchement

source: Latch distance
fr: Distance enclanchement

source: Latch feed
fr: Recherche du loquet

source: Probe latch feed
fr: Sonde à la recherche du loquet

source: Depth
fr: Profondeur

source: Maximum depth
fr: Profondeur maximale

source: Rappid
fr: Accéléré

source: Rappid height
fr: Hauteur pour l'accéléré

source: Circle
fr: Cercle

source: <big>Creates circle</big> Parameters: <i>CX CY R Depth Rappid</i>
fr: <big><b>Créer un cercle</b></big> Paramètres: <i>cX, cY, Diamètre</i>

source: D
fr: Diamètre

source: Diameter
fr: Diamètre

source: Depth step
fr: Pas de profondeur

source: Depth step per pass
fr: Pas de profondeur par passe

source: Surface height
fr: Hauteur de la surface

source: Final cut
fr: Coupe finale

source: Circular array
fr: Tableau circulaire

source: X of array center
fr: Position X du centre du tableau

source: Y of array center
fr: Position Y du centre du tableau

source: Array diameter
fr: Diamètre du tableau

source: Start angle
fr: Angle du début

source: Angle for the first array item (0 points to X positive direction)
fr: Angle du premier item du tableau (0 pointe à une position positive X)

source: Fill angle
fr: Emplir sur angle

source: Angle to fill with array
fr: Angle à emplir avec le tableau

source: Rotate items
fr: Tourner items

source: Rotate each item (1=Rotate, 0=No)
fr: Tourner chaque item selon sa position (1=Tourné, 0=Non)

source: Rectangle from center
fr: Rectangle depuis le centre

source: Creates rectangle from center cX cY W H
fr: <big><b>Crée un rectangle depuis le centre</b></big> Paramètres: <i>cX, cY, Largeur, Hauteur</i>

source: Width
fr: Largeur

source: Height
fr: Hauteur

source: Tool change
fr: Changement d'outil

source: <big>Adds tool change Gcode</big> T#n M6
fr: <big><b>Ajout de Gcode pour changement d'outil</b></big> Paramètre: <i>Numéro de l'outil</i>

source: Tool number
fr: Numéro de l'outil

source: Toola number from tools table
fr: Numéro de l'outil inscrit dans la table

source: G91 group
fr: Groupe G91

source: <big>Create line</big>
fr: <big><b>Créer une ligne</b></big>

source: Drop items here
fr: Déposez les items ici

source: Arc tangent
fr: Arc tangente

source: G2 or G3
fr: G2 ou G3

source: Use G2 (CW) or G3 (CCW) arc (write only 2 or 3 without G)
fr: Utilisez G2 (sens horaire) ou G3 (anti-horaire) pour sens de l'arc (écrire seulement 2 ou 3 sans le G)

source: R
fr: Rayon

source: End angle
fr: Angle de fin

source: Angle at the end
fr: Angle à la fin

source: Line
fr: Ligne

source: Distance along axis
fr: Distance le long de l'axe

source: Coordinate along axis
fr: Coordonnée le long de l'axe

source: Absolute or increment discance 90 - Absolute 91 - Increment Other - do not use current
fr: Distance absolue ou relative 90 - Absolue 91 - Relative Autre - do not use current

source: Axis
fr: Axe

source: Shift along 0 - arbitrary x-axis 1 - arbitrary y-axis
fr: Déplacement selon 0 - axe X arbitraire 1 - axe Y arbitraire

source: <big>Goes to defined point</big>
fr: <big><b>Aller à un point défini</b></big>

source: X of a point
fr: Valeur X d'un point

source: Y of a point
fr: Valeur Y d'un point

source: Probe cube
fr: Sonder un cube

source: <big>Probe cube</big> Probes hole to find it&#39;s center
fr: <big><b>Sonder un cube</b></big>

source: Approximate CX
fr: CX approximatif

source: Approximate CY
fr: CY approximatif

source: Approximate Radius (must be larger than hole)
fr: Rayon approximatif (doit être plus grand que le trou)

source: Latch distance If Latch distance greater than 0 than probe will go back and Latch in the same direction. Else Latch will be done in oposite direction (stop on loss of contact).
fr: Distance de loquet Si la distance du loquet est supérieure à 0, alors le sonde reculera et fermera le loquet dans la même direction Autrement la recherche se fera dans la direction opposée et se fermera à la perte de contact.

source: Probe depth
fr: Profondeur de la sonde

source: Flat Gcode \n can be used to split lines lines will be parsed as usual so you can use &lt;eval&gt;&lt;/eval&gt;
fr: <bib>Gcode plat</big> utiliser pour couper des lignes vous pouvez insérer &lt;eval&gt;&lt;/eval&gt;

source: Line 5
fr: Variable 5

source: Gcode line
fr: Variables de GCode

source: Line 4
fr: Variable 4

source: Line 1
fr: Variable 1

source: Line 3
fr: Variable 3

source: Line 2
fr: Variable 2

source: Hexagon
fr: Hexagone

source: <big>Creates hexagon</big> cX cY r depth rappid <b>Uses G92!</b>
fr: <big><b>Créer un hexagone</b></big> Paramètres: <i>cX, cY, Rayon, Profondeur, Accéléré</i> <b>Utilise G92!</b>

source: Starting angle
fr: Angle de début

source: Central radius
fr: Rayon central

source: Center X
fr: Centre X

source: Center Y
fr: Centre Y

source: Tool
fr: Outil

source: Selects tools and changes its parameters
fr: Sélectionnez un outil et changez ses paramètres

source: Length
fr: Longueur

source: Tools depth step for multipass mill
fr: Pas de profondeur d'outil pour passage multiple

source: Creates rectangle W H X0 Y0
fr: <big><b>Créer un rectangle</b></big> Paramètres: <i>X0, Y0, Largeur, Hauteur</i>

source: Probe tool diameter
fr: Diamètre de la sonde

source: <big>Probe cube</big> Probes tool diameter on fixed probe Will be useing G59.3 coordinate system!
fr: <big><b>Sonder un cube</b></big> Probes tool diameter on fixed probe <b>Utilise le système de coordonnées G59.3</b>

source: Probe X
fr: Sonder X

source: Approximate CX in G53
fr: CX approximatif en G53

source: Probe Y
fr: Sonder Y

source: Approximate CY in G53
fr: CY approximatif en G53

source: Approximate Radius plus probe radius (must be upper approximation)
fr: Rayon approximatif plus rayon de la sonde (must be upper approximation)

source: Probe depth in G53
fr: Profondeur de sonde en G53

source: Rectangle from center with steps
fr: Rectangle depuis le centre (par étapes)

source: Creates rectangle from center with multipass cutting cX cY W H
fr: Créer un rectangle depuis le centre par passe multiples Paramètres: <i>cX, cY, Largeur, Hauteur</i>

source: Set cuting params
fr: Établir paramètres de coupe

source: Sets global cutting depth, depth step, surface origin, and rappid distance.
fr: Établis les paramètres globaux de coupe , le pas, l'origine de la surface et la hauteur de l'accéléré.

source: Final cut depth
fr: Profondeur de la coupe finale

source: Rappid distance
fr: Distance en accéléré

source: Set probing params
fr: Établir les paramètres de sondage

source: Sets global probing parameters
fr: Établir les paramètres globaux de sondage

source: Latch Feed
fr: Vitesse d'alimentation de lecture de loquet

source: Probing Feed
fr: Vitesse d'avance de sondage

source: Latch
fr: Loquet

source: N-gon
fr: Polygone (N côtés)

source: <big>Creates n-gon</big> polygon with n edges cX cY n r depth rappid <b>Uses G92!</b>
fr: <big><b>Créer un polygone de n côtés</b></big> Paramètres: <i>cX, cY, n, Rayon, Profondeur, Accéléré</i> <b>Utilise G92!</b>

source: Number of edges
fr: Nombre de côtés

source: Oval
fr: Ovale

source: <big>Creates oval</big> Oval - rectanle + two circles Parameters: <i>CX CY D L</i>
fr: <big><b>Créer un ovale</b></big> Ovale - rectangle + 2 cercles Paramètres: <i>cX, cY, Diamètre, Largeur</i>

source: L
fr: Largeur

source: Length of oval
fr: Longueur de l'ovale

source: Diameter of oval
fr: Diamètre de l'ovale

source: Probe hole
fr: Sonder un trou

source: <big>Probe hole</big> Probes hole to find it&#39;s center
fr: <big><b>Sonder un trou</b></big> Rechercher le centre d'un trou

source: Set tool probing params
fr: Établir les paramètres de la sonde

source: Sets global tool probing parameters
fr: Établir les paramètres globaux de la sonde

source: Approximate probe X in G53
fr: Sonde approximative X en G53

source: Approximate probe Y in G53
fr: Sonde approximative Y en G53

source: Probe Z
fr: Sonder valeur Z

source: Probe Z in G53
fr: Sonder valeur Z en G53

source: Name
fr: Nom

source: Value
fr: Valeur

source: Cutting
fr: Coupe

source: Draw
fr: Dessin

source: Pocketing
fr: Pochette

source: Rectangular pocket
fr: Pochette rectangulaire

source: Grouping
fr: Groupes

source: Probing
fr: Sonde

source: Circles
fr: Cercles

source: Polygon
fr: Polygones

source: Rectangle from Center
fr: Rectangle depuis le centre

source: Line absolute
fr: Ligne position absolue

source: Line relative
fr: Ligne position relative

source: Close drawing
fr: Fermer dessin

source: Arc to
fr: Arc

source: Array
fr: Tableau

source: Probe down
fr: Sonder vers le bas

source: Measure tool length
fr: Mesure longueur d'outil

source: Measure tool diameter
fr: Mesure diamètre d'outil

source: Auto refresh
fr: Rafraîchissement automatique
